In [ ]:
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [10]:
import pandas as pd
data=[4,8,15,16,23,42]   # this is the list
pd_series=pd.Series(data)
print(pd_series)
type(pd_series)          # series is equivalent to list

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

pandas.core.series.Series

In [ ]:
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [5]:
import pandas as pd
my_list=[2,5,'pankaj',6.9,7+7j,'k',44,466, 'li', 5677.4,10]
my_series=pd.Series(my_list)
print(my_series)
type(my_series)      #series
# print(my_list)
# type(my_list)      # list

0          2
1          5
2     pankaj
3        6.9
4     (7+7j)
5          k
6         44
7        466
8         li
9     5677.4
10        10
dtype: object

pandas.core.series.Series

In [ ]:
Q3. Create a Pandas DataFrame that contains the following data:
    Name:Alice,Bob,Claire
    Age:25,30,27
    Gender:Female,Male,Female
Then, print the DataFrame.

In [2]:
import pandas as pd
data={
       'Name':['Alice','Bob','Claire'],
       'Age':[25,30,27],
       'Gender':['Female','Male','Female']
     }
df=pd.DataFrame(data)
print(df)
type(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

pandas.core.frame.DataFrame

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
'''
DataFrame:-
A DataFrame is a 2-dimensional labeled data structure with columns that can contain data of different types 
(numeric, string, etc.). It can be thought of as a spreadsheet or SQL table, where each column can be seen as a Series.
A DataFrame is essentially a collection of Series aligned along a common index.

Series:-
A Series is a 1-dimensional labeled array-like object capable of holding any data type. It's similar to a single column of 
data or a simple array with an associated label called an index.'''

In [13]:
import pandas as pd
data={
       'Name':['Alice','Bob','Claire'],
       'Age':[25,30,27],
       'Gender':['Female','Male','Female']
     }
df=pd.DataFrame(data)
print("DataFrame: ")
print(df)
#type(df)     #DataFrome

#df.columns

srs=pd.Series(['Alice','Bob','Claire'],name='Name')
print("\nSeries: ")
print(srs)
type(srs)    #Series

DataFrame:
     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Series:
0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

pandas.core.series.Series

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you
might use one of these functions?

In [33]:
import pandas as pd
df=pd.read_csv("biostats.csv")   # let biostats.csv is the csv file that consists following data
print(df)
df.columns

    Name       "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
0   Alex         "M"      41              74              170
1   Bert         "M"      42              68              166
2   Carl         "M"      32              70              155
3   Dave         "M"      39              72              167
4   Elly         "F"      30              66              124
5   Fran         "F"      33              66              115
6   Gwen         "F"      26              64              121
7   Hank         "M"      30              71              158
8   Ivan         "M"      53              72              175
9   Jake         "M"      32              69              143
10  Kate         "F"      47              69              139
11  Luke         "M"      34              72              163
12  Myra         "F"      23              62               98
13  Neil         "M"      36              75              160
14  Omar         "M"      38              70              145
15  Page         "F"      31              67              135
16  Quin         "M"      29              71              176
17  Ruth         "F"      28              65              131

Index(['Name', '     "Sex"', ' "Age"', ' "Height (in)"', ' "Weight (lbs)"'], dtype='object')

In [18]:
df.head()

   Name       "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
0  Alex         "M"      41              74              170
1  Bert         "M"      42              68              166
2  Carl         "M"      32              70              155
3  Dave         "M"      39              72              167
4  Elly         "F"      30              66              124

In [20]:
df.head(3)

   Name       "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
0  Alex         "M"      41              74              170
1  Bert         "M"      42              68              166
2  Carl         "M"      32              70              155

In [21]:
df.tail()

    Name       "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
13  Neil         "M"      36              75              160
14  Omar         "M"      38              70              145
15  Page         "F"      31              67              135
16  Quin         "M"      29              71              176
17  Ruth         "F"      28              65              131

In [22]:
df.tail(3)

    Name       "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
15  Page         "F"      31              67              135
16  Quin         "M"      29              71              176
17  Ruth         "F"      28              65              131

In [25]:
df.info()     #info(): Provides information about the DataFrame, including data types and memory usage. Useful for getting an overview of the dataset.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Name             18 non-null     object
 1        "Sex"       18 non-null     object
 2    "Age"           18 non-null     int64
 3    "Height (in)"   18 non-null     int64
 4    "Weight (lbs)"  18 non-null     int64
dtypes: int64(3), object(2)
memory usage: 848.0+ bytes

In [27]:
df.describe()  #describe(): Generates summary statistics of numeric columns, like mean, min, max, etc. Useful for initial data exploration.

           "Age"   "Height (in)"   "Weight (lbs)"
count  18.000000       18.000000        18.000000
mean   34.666667       69.055556       146.722222
std     7.577055        3.522570        22.540958
min    23.000000       62.000000        98.000000
25%    30.000000       66.250000       132.000000
50%    32.500000       69.500000       150.000000
75%    38.750000       71.750000       165.250000
max    53.000000       75.000000       176.000000

In [43]:
df.sort_values(by=' "Age"',ascending=False)  #by default ascending=True
                                             #sort_values(): Sorts the DataFrame by specified columns. Useful for arranging data in a specific order.

    Name       "Sex"   "Age"   "Height (in)"   "Weight (lbs)"
8   Ivan         "M"      53              72              175
10  Kate         "F"      47              69              139
1   Bert         "M"      42              68              166
0   Alex         "M"      41              74              170
3   Dave         "M"      39              72              167
14  Omar         "M"      38              70              145
13  Neil         "M"      36              75              160
11  Luke         "M"      34              72              163
5   Fran         "F"      33              66              115
9   Jake         "M"      32              69              143
2   Carl         "M"      32              70              155
15  Page         "F"      31              67              135
7   Hank         "M"      30              71              158
4   Elly         "F"      30              66              124
16  Quin         "M"      29              71              176
17  Ruth         "F"      28              65              131
6   Gwen         "F"      26              64              121
12  Myra         "F"      23              62               98

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
"""Both Series and DataFrame are mutable in nature, meaning you can modify their contents after creation. However, as I mentioned earlier, 
   Panel is considered deprecated and not recommended for use in recent versions of pandas. """

In [48]:
import pandas as pd
data=[2,4,5,6,7,8,8]
srs=pd.Series(data)
print("Origiona Series: ")
print(srs)

srs[0]='pankaj'
srs[3]=797.789
print("After modification Series: ")
print(srs)

Origiona Series:
0    2
1    4
2    5
3    6
4    7
5    8
6    8
dtype: int64
After modification Series:
0     pankaj
1          4
2          5
3    797.789
4          7
5          8
6          8
dtype: object

In [56]:
import pandas as pd
data={
       'Name':['Alice','Bob','Claire'],
       'Age':[25,30,27],
       'Gender':['Female','Male','Female']
     }
df=pd.DataFrame(data)
print("Origional DataFrame: \n")
print(df)

df.at[1,'Name']="Pankaj"   # modification in a cell value
df['add']=['sikar','jaipur','kukas']
print("\nAfter modification Dataframe: \n")
print(df)

Origional DataFrame:

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

After modification Dataframe:

     Name  Age  Gender     add
0   Alice   25  Female   sikar
1  Pankaj   30    Male  jaipur
2  Claire   27  Female   kukas

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [72]:
import pandas as pd
srs_names=pd.Series(['Alice','Bob','Claire'])
srs_ages=pd.Series([25,30,27])
srs_genders=pd.Series(['Female','Male','Female'])

#type(srs_names)   #Series

data={
      'Name': srs_names,
      'Age': srs_ages,
      'Gender': srs_genders
     }
df=pd.DataFrame(data)
print(df)
type(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

pandas.core.frame.DataFrame